{"podcast_details": {"podcast_title": "The 5 Minute Mom Podcast", "episode_title": "Summer In The Psalms: Psalm 126 with Lauren Diggs", "episode_image": "https://ssl-static.libsyn.com/p/assets/4/4/d/5/44d527d0177b68ed/Audra_5_Min_Mom_Cover-02-1.png", "episode_transcript": " The best time to get a great deal on a Jeep SUV is now during the Summer of Jeep event. Visit Jeep.com or your local Jeep brand dealer to find the perfect Jeep SUV for you. Hurry in and make this the Summer of Jeep. Right now during the Summer of Jeep, purchasing at 10% below MSRP on the 2023 Jeep Compass Limited 4x4 or Renegade Latitude 4x4. Not compatible with lease offers or any other consumer incentive offers. Contact dealer for details, residency restrictions applied. Take retail delivery by 731-23. Jeep is a registered trademark. Hey there, MommaFriend, and welcome to the 5-Minute Mom Podcast, where we'll talk about real life, real faith, real fast. To learn more about all of our co-hosts or to sign up for a free monthly resource email, be sure to check out all the links in the podcast show notes. Hey, sweet friends, Lauren here. I want to welcome you to our Summer in the Psalms. I just love the Psalms, and one of my favorites is Psalm 126. So let's jump in there. When the Lord restored the fortunes of Zion, we were like those who dream. Then our mouth was filled with laughter and our tongue with shouts of joy. Then they said among the nations, the Lord has done great things for them. The Lord has done great things for us. We are glad. Restore our fortunes, O Lord, like streams in the Negev. Those who sow in tears shall reap with shouts of joy. He who goes out weeping, bearing the seed for sowing, shall come home with shouts of joy, bringing his sheaves with him. This is one of my favorites because there was a time in my marriage when it was really, really difficult. And I wasn't even sure if we were actually going to make it. We were coming out of an affair and there was just a lot of rebuilding that needed to happen. And I felt very hopeless. But when I would look back on this Psalm, it would fill me with hope. It would give me the joy and the strength I needed to continue to move forward in where I believe God was calling me to be as a wife in our marriage in that time. And it just reminded me that even though I might sow in tears, I will reap with shouts of joy. And that even though I might weep for a time, there will be joy that will come. And it will come not only in little increments, but in shouts. When you think about shouting with joy, have you ever shouted for something because you've been so excited and so happy and cheered, you know, the cheering on and the things that come from that? That is the kind of reaping that we have, even when we sow in sorrow and we sow in tears. So I just want to encourage you today as you are listening to just be reminded that even though we might have times of sorrow, even though we might be in the middle of something where all we feel like we are doing are sowing tears and all we feel like that's happening is just hopeless. And we really can't see the light at the end of the tunnel. Just remind yourself that what is happening right now is not the end of the story that God is working and he is moving on your behalf and on behalf of those who are involved in whatever is happening. And he is working for your good and for his glory. And that one day, one day you will reap a harvest with shouts of joy over tears that have been sown. So hang in there, sweet mama friend. Let's pray. Father, you are so, so, so good to us, God. There is not anything that is wasted with you. Not one tear, not one word, not when we labor. None of it, God, is in vain. Because we know that you are taking, Father, what we are giving over to you and you are working it out for our good and for your glory. We know that in times of sorrow, God, there will come joy. There will come restoration. We just need to wait on you, to surrender to you and to walk according to your will and your plan for our lives. In that moment, where we are at right now, God, is where you have called us. So help us to fix our eyes on you. Help us, Father, when we feel hopeless, when we feel as though what it is that we are going through is not going to get better. It couldn't possibly. We can't possibly see a better way or an end. Remind us, God, that where we are at right now is not forever. But that we have forever with you to look forward to, put a joy within our soul, even in the midst of our sorrow, God. Strengthen us with that joy, Father, that only comes from you. And if we are in a season right now of sowing, Father, I pray, God, that when we enter into the season of harvest, that we would reap that harvest with shouts of joy and adoration and gratitude to you and who you are and all that you have done. We know you are faithful, God. You are faithful to restore. You are faithful to redeem. You are faithful to renew. And we know that we can count on you, Father. We can count on you to hold us in our times of sorrow and that as you hold us, you are still working and moving. Remind us of these truths, God, that we find here in Psalm 126, Lord. Remind us that you are the one who restores, God. You are the one who fills our mouths with laughter and our tongues with shouts of joy. Remind us that you have done great things and you will continue to do great things. Remind us that when we go out weeping, we will not return weeping. Remind us that when we put forth tears, we do not get sorrow back. You are so good to us, Lord. Fill us with hope. Fill us with joy. And make us more and more like you as we walk through each and every day, surrendering to you and leaning on your grace and mercy. We love you, Father. In Jesus' name we pray. Amen."}, "podcast_summary": "In this episode of the 5-Minute Mom Podcast, the co-host talks about finding hope and joy in difficult times, using Psalm 126 as inspiration. She shares her own personal experience of going through a challenging period in her marriage and how this Psalm gave her strength and reminded her that sorrow does not have the final say. She encourages listeners to hold on to the promise that even in the midst of tears, there will come a time of reaping with shouts of joy. The episode ends with a prayer for God's faithfulness and restoration.", "podcast_guest": "Lauren", "podcast_highlights": "When the Lord restored the fortunes of Zion, we were like those who dream. Then our mouth was filled with laughter and our tongue with shouts of joy."}