{"podcast_details": {"podcast_title": "American Girl 10 Minute Mysteries", "episode_title": "Diving Deeper - Episode 10: To Catch a Thief Discussion Questions", "episode_image": "https://megaphone.imgix.net/podcasts/4e09c884-d713-11ec-92da-b7c67bc2e446/image/10MM_Cover.png?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " You're listening to the American Girl Podcast Network. Hi, I'm Maggie Lawson, the narrator of 10 Minute Mysteries. This season's story is based on one of our favorite American Girl mystery books, The Light in the Cellar, a Molly mystery by Sarah Buckey. You're listening to a special version of 10 Minute Mysteries. Stay tuned after the episode for engaging and exciting discussion questions that you can answer together as a family. Episode 10, To Catch a Thief. Hidden beneath a pine tree at the top of Overlook Hill Road, Molly and Emily watched a black truck drive slowly down the driveway to Greystone Manor. Although it was nighttime, the truck's headlights were off, as though the driver didn't want to be seen. As soon as the truck disappeared around a curve, Molly and Emily jumped up and ran down the road toward the park. About halfway down, Molly stopped, pulled out Susan's junior first aid whistle, and gave three short blasts. They heard us! Molly exclaimed, and she and Emily continued running. When they reached the park, Linda and Susan were waiting for them by the oak tree on the corner. We heard your whistle! Did the boys hear it too? Molly asked breathlessly. Ricky and David had been waiting halfway between the park and the McIntyre's house. It was their job to ride their bikes to the McIntyre's and tell Jill to call the police. I hope so, said Susan. If they didn't, the plan won't work. Molly handed the whistle back to Susan, listening for a siren. The police have to come in time, she thought anxiously. They just have to! At the sound of a vehicle, Molly looked up, hoping to see the lights of a police car. Instead, she saw the black truck coming down Overlook Hill Road. Its headlights still dark. It's the thieves, she thought, and they're getting away! When the truck reached the bottom of the hill, its headlights came on. As it drove by the park, the gold lettering on the side of the truck glinted in the streetlight, and Molly read the words, Lawrence Laundrie. Mr. Lawrence lied to me! She realized he wanted me to suspect Marta, but he's the thief! The truck was about to pull onto the main road when a police car sped up to the intersection. Just then, Ricky and David came riding up on their bicycles. The policemen motioned to the truck driver, and the truck pulled over and stopped. The driver stepped out. Molly recognized Mr. Lawrence and saw that he was smiling. Suddenly she felt a pang of doubt. What if he wasn't the thief after all? Two police officers got out of the patrol car. The taller one shone a flashlight on the truck. Mr. Lawrence said, What's the matter, Charlie, is there a problem? Oh, it's you, Roy. Nah, no problem. We just got an anonymous tip about a truck with stolen goods up on Overlook Hill. You seen anything suspicious up there? Not a thing, said Mr. Lawrence with a shrug. He explained that he'd been on a late delivery, adding, You know these rich folks. They're having a party tomorrow, and they can't have stains on the servants' uniforms, can they? He's lying! We saw the truck go down the driveway of Greystone Manor. Molly whispered to Ricky, as the officers turned and walked back to the patrol car. We'll just drive up the hill and see if there's anything suspicious going on, the taller policeman called to Mr. Lawrence. You can't be too careful these days, can you? Said Mr. Lawrence, turning to get back into his truck. Are they going to let him get away? Asked Linda. No! Molly shouted. The shorter police officer whipped around and said, What? You can't just let Mr. Lawrence drive away! Said Molly. Look in the back of his truck. I bet there's no uniforms in there. What are you kids doing out at this time of night? Asked Mr. Lawrence. He turned to the taller officer, the one he seemed to know. Say Charlie, maybe these young hooligans are the one you gotta tip about. No, he's the one. Look in the back of his truck, said Ricky, stepping up beside Molly. Please take a look, officer, Emily chimed in. The shorter officer, a broad-shouldered young man, shrugged and said, Sure, why not? Before Mr. Lawrence could protest, the officer opened the back of the truck. Molly held her breath while he shone his flashlight inside and gave a long, low whistle. Those sure don't look like uniforms to me, he said. Not unless they're packing them in sugar bags these days. Suddenly, Mr. Lawrence took off running across the park. The young officer sprinted after him and tackled him, sending him sprawling on the grassy field. The kids cheered as the officer pulled Mr. Lawrence to his feet, handcuffed him, and led him to the patrol car. Molly, Emily, and Ricky arrived home, just as Mrs. McIntyre came home from her long day serving cookies to soldiers at the canteen. Jill was waiting for them at the door. Before Mrs. McIntyre could ask why they were all up so late, Jill said anxiously, Did the police get there in time? Yes, said Molly, and they arrested Mr. Lawrence. You should have seen the tackle, said Ricky. The cop must have been a football player. Their mother looked confused. What's this about the police? She asked. And who is Mr. Lawrence? He's the thief who's been stealing all the sugar, said Molly. Mrs. McIntyre sank into a chair, saying, Please start at the beginning. Well, said Molly, when the puppies ran away, we went to Greystone Manor and saw a light in the cellar. After school on Tuesday, Molly and Emily biked together to Oak Knoll. Molly took her magazines to all the second floor patients, remembering to keep the National Geographic for Philip. She saved room 201 for last. Come in, dear, Mrs. Currier called. You won't believe the excitement I've had. It seems the police discovered that our very own Mr. Lawrence, the laundry man, has been stealing things to sell on the black market. His brother was helping him, and they were storing the goods in my cellar. Isn't that shocking? Molly tried to look surprised and said, Yes, ma'am. I just wish I had someone living in the chauffeur's apartment on my estate to watch over the manor while I'm away. What about Marta? She's been looking for an apartment, said Molly. Why Marta would be an excellent caretaker. She's so devoted to her daughter and always willing to make me a cup of tea. Mrs. Currier paused and looked hopefully at Molly, who smiled and said, I'd be glad to go get you some tea. Thank you, dear. And please ask Marta to come to my room so I can talk to her. Molly hurried down to the kitchen. As Marta prepared a tea tray, Molly told her about the apartment. And Mrs. Currier wants to talk to you about it right now. Marta nodded eagerly, and Molly followed her upstairs, excited to tell Emily the good news about Marta. But at the first floor landing, Molly saw Emily walking out the back door. That's odd, thought Molly. She didn't even wait for me. Molly went out to the parking lot where Emily was standing by her bike. Are you all done with your deliveries? Asked Molly. Emily nodded. She handed Molly a shiny new junior first aid whistle saying, Here, Mr. Pritchard gave us these. He heard we helped catch the thieves, and he's very grateful. He also said he's glad that we work at his hospital. Golly, that was nice. I'm sorry I ever suspected him, said Molly. Molly, Auntie Prim is going home tomorrow, so I'm moving into her cottage this weekend. I won't be able to work at the hospital with you anymore. I'll give you back your bicycle. Thank you for letting me borrow it. Molly felt her face grow hot. She doesn't even care about saying goodbye, she thought. She won't even turn around and look at me. After a moment, Molly said, Well, let's go home. I mean to my house. Emily nodded, still looking away. But as she turned to get on her bicycle, Molly saw a tear run down her cheek. Emily, what's the matter? Molly asked. It's- Oh, Molly, I'm glad Auntie Prim is better, but I shall miss being at your house very much. I've always wanted to have a sister like you, and your family has been so kind. But Auntie Prim is still weak, and she needs my help with things like cooking meals. That's why I won't have time to volunteer here at the hospital with you anymore. Molly sat on her bicycle seat, her feet planted on the ground, but her mind spinning. It wouldn't be nearly as much fun being a magazine girl all alone. But if I stop, she thought to herself, then who will bring Philip National Geographic's or get tea for Mrs. Courier? Molly looked at Emily and said, Wait, I have an idea. Why don't we both keep coming here on Tuesdays and Thursdays, and then afterward, I'll go to your aunt's house with you. I know how to cook hot dogs and beans, and macaroni and cheese, and I can help you clean up too. If we do it together, it won't take nearly as much time. Now it was Emily's turn to be surprised. She looked up at Molly, a smile spreading across her face, and said, Really? You wouldn't mind? It would be fun, said Molly, and you can keep the bicycle. We can ride our bikes back and forth to each other's houses. Bennett and Yank will want to visit each other too. That would be lovely, Emily exclaimed, her face lighting up. Then she grasped the handlebars of her bike and grinned, Come on, Molly, let's go. I'll race you home. Wow, it was Mr. Lawrence all along, and he almost got away with it too. Good thing Molly and Emily were there to step in and stop him. And thank you for all of your help in solving this case. Let's answer some discussion questions together. When Molly and Emily are at their evening stakeout, they see a truck going into Greystone Manor. What is their clue that the truck's driver doesn't want to be seen? Molly is surprised to discover that Mr. Lawrence is the thief. Were you surprised? Why or why not? What did you think about the kids' interactions with the police officers? In that situation, would you have made the same choice to speak up? When Molly learns that Emily will soon be moving out of her house and going to live with her aunt, why does Molly feel hurt at first? What does she learn about Emily that changes her feelings? Do you think it would be exciting to solve a mystery as Molly and her friends did? Thank you so much for listening to 10 Minute Mysteries. And parents, don't forget to write us a review wherever you are listening. It really helps us out. Kids can watch 10 Minute Mysteries with their family on YouTube or your child can watch on YouTube Kids. Visit AmericanGirl.com and follow at American Girl Brand on Instagram for more updates on your favorite dolls, books, and American Girl Podcast Network podcasts. Stay tuned for more exciting cases and mysteries to solve coming soon."}, "podcast_summary": "Molly and her friends witness a suspicious truck at Greystone Manor. They blow a whistle to alert their friends and the police about the thieves. The police stop the truck and discover stolen goods inside. Mr. Lawrence, the driver of the truck, is arrested. Molly and her friends celebrate their successful mission.", "podcast_guest": "Maggie Lawson", "podcast_highlights": "Molly and Emily witness a suspicious black truck driving to Greystone Manor."}