{"podcast_details": {"podcast_title": "10-Minute Contrarian", "episode_title": "Ep113: Coal", "episode_image": "https://deow9bq0xqvbj.cloudfront.net/image-logo/11945887/Cover_JPEG_For_Apple_x9y8hc.jpg", "episode_transcript": " This is the 10-Minute Contrarian Podcast. This is VP. We are a solutions-based podcast, diving into the world of contrarian investing and alternative finance. You can find us hosted on the NoNonsense4X YouTube channel, NoNonsense4X.com, and podcast players everywhere. Episode 113 is brought to us by Bybit. There's still five or six days left to sign up for the World Series of Trading, $8 million prize pool, Lamborghini, Rolex, bunch of crap in there. But unfortunately, you will not be on Team VP anymore. They broke up our team. We didn't have enough to fill the minimum requirements, which is not surprising. And this actually could be good news because now you would actually have a chance of maybe winning something just on sheer numbers alone. So you can sign up, have a better chance of winning, and get all the perks and benefits of being somebody who signed up through my affiliate link, which you will find down below in the description in the blog towards the bottom. But get yourself signed up. Hopefully in a week or so, the volume comes back in the crypto market and we can have ourselves a nice contest. And even though you're not on my team anymore, I wish you all the best because you are still on Team VP no matter what. Why? Because membership has its rewards, including my support. And you can't put a price on that. It is the Tim and a Concharian podcast. And I said last week on the Energy Cliff episode that we will be pointing back to that episode many times into the future. So it's one week later and here we are doing it. Just to reiterate, energy is everything. Without it, life just doesn't exist for most people. You can't just tell your modern man or woman to go outside and burn wood for energy. It won't work, they'll die. Problem is there is an increased chance that we are going to go off of this energy cliff. Now let me remind you again what that's like. We don't just run out entirely. Think of like a worst case scenario for Europe right now with natural gas to where you're gonna have some years where you just have a lot of it and then you have other years where you absolutely don't have enough. And this is a very chaotic result that just nobody is prepared to deal with. You know, the Western world has always had things right there exactly when we wanted them. And you have one little rip in the fabric of our supply chains and everything just goes sideways. Now imagine that same inconsistency, but not with things, but with actual energy. That's wild. And for some places, it's going to be a matter of survival. And those countries leaders don't really care about their people. They just don't want those people revolting. And if they're cold and hungry, they're going to revolt. So they will turn to whatever energy sources are out there to keep their people warm and just happy enough to where they won't be breaking the pitchforks out. And believe me, this is far more important to them than some goofy Western concocted ESG standard is. Especially now that that whole movement has lost steam the way it has. Because believe me, it was strong four or five years ago. So strong that it completely shut down the coal industry almost entirely. Even in the East, as even places like China and Russia were scrambling to adhere to this ESG standard to make trading a lot easier with the West. You know, they were burning coal, just not as much as they were before. But alas, the ESG narrative started to die, especially when people saw how poorly it was actually working. It didn't take long. You know, necessity trumps idealism. And even if the people who created these ideals are forcing them on you, you know, it's Maslow's hierarchy of needs. We need to survive first. And Germany was the perfect test monkey for this. They went all in on ESG. And then when it failed miserably, they turned to the dirtiest fuel out there, which is coal. And they are still using a lot of it today. It's dirty, it's gross, but God damn it, it just works better than anything else out there. You know, unless you're fortunate enough to have hydro or had the foresight to still have nuclear, coal really is where it's at. And in times of necessity, like, oh, I don't know, a big recession, the energy cliff, any other type of energy crisis, coal is only going to get more popular and more in demand. And that's why I love it as a contrarian play. I loved it before, back when you had the KOL ETF, and then ESG got rid of it. So much investment went out of the coal sector, even worse than oil. And we know how much that killed the oil industry for a while. Now, fortunately for humanity, coal can recover a lot quicker than oil can. And it is now being used more than it ever has been used before in the history of the world. And it's only going to grow. So let's take the two top coal producing countries in the world, just happen to be the two countries with the highest population, and that's going to be China and India. And you're like, well, good, that's beneficial because they can produce enough coal for what they need. No, actually, they still both, China and India, import a lot of coal. Oh, and guess who does not produce a lot of coal, but who is coming to the party, is already halfway at the party. But you remember Pakistan, you know, only the fifth largest country in the world by population back when they got outbid for all that natural gas last year. Well, Pakistan learned a very rough lesson during that process. And that lesson was, hey, no matter what happens, we're always going to get outbid for things like natural gas. We are interested in doing things more cleanly, but it looks like we're not going to be able to. So where do you turn in this case? Well, nuclear, well, they don't have the plants built. Oil, they're going to get outbid for that too. Wind and solar, LOL. They are turning to coal as well. Coal consumption in Pakistan is way up. Again, in a crisis, in a recession, entire nations are not only going to turn to what is the cheapest, they're going to turn to what works the best. All of this save the environment, ESG, inclusion, all of those narratives are all narratives you see at the very, very top of a market where there are no other actual problems to worry about. And not that those things wouldn't be nice things to have. They're just the types of things you worry about when there's nothing else to worry about. And when this economic downturn and when this energy crisis comes about, there are going to be a lot more important things to worry about. I tell my environmentalist sister all the time, I said, look, nobody is going to give a shit when the lights go out. There are places right now where they're having rolling brownouts every month or so for like half a day. And sentiment in those places has already moved completely away from any type of environmentalism. Take away TikTok for two hours a day and watch sentiment completely change in the West. Now, back when the KOL ETF in the United States was available, I loved it. I said, what a great contrarian play this is with something like coal bottoming out with these edicts that I know are not going to work like people think they're going to work. I was really interested. And then right when I was about to pull the trigger, they took it away. Now, I won't be getting in at the bottom anymore, but that's fine. I've done pretty well so far without ever getting in on a bottom. But interesting enough, what the price of coal has done is it has bottomed out through the last few years of the last decade, had a nice little pop for a while, and now it's back down again. It's not back down to bottom prices. But if you go look at a chart at the price of coal, you'll see exactly what I'm talking about. So there's a lot of room for it to go back up and hit those highs and in my opinion, travel far beyond them. And I've been doing sporadic due diligence here and there for the past month, looking for exactly where I want to invest in. Now, I'm not going to share that with you because these are individual companies because currently there are still no coal ETFs in the United States, at least right now. And because the US and Canada usually have the most ETFs, I would wager to say you're going to have a hard time finding an ETF anywhere else either. So you're going to have to go down to individual companies, which means you're going to have to do a little bit of work, gasp. You know, you can't just wait for VP to mention something and just ape into it, which I know some of you out there do. I know this for a fact. So dumb, don't do that. What I can say is to watch out for a few things when you do your research here. And look, this research is worth doing. I'm very bullish on the future of coal. Especially because we had that price drop that I feel was unwarranted. But that's where we're at right now. Oddly enough, you may not see the same level of price drop in some of these companies, but I'm okay with that. As the price of coal rises like anything else, these companies probably will too. Because look, contrarians, we are going to need alternatives to oil and gas. I am certainly not against renewables. If renewables were where they should be right now, then this wouldn't even be a problem. Unfortunately, they're just not. And this whole forced implementation of these generation one power generators in the form of wind and solar was mostly a terrible move. And Asia, i.e. where the most people are, have already figured this out. They're fully on board with this move. And it's just going to be a matter of time before other countries figure it out too. So anyway, the things I want you to look out for when you're researching these companies is, number one, is coal all they do? The answer is probably no. Not financial advice, but if I were you, I would not want to invest in what you think is a coal company that is actually a base metals company. Why have you not talked about base metals yet on the show, VP, because I'm not bullish on them. I'm bearish on the economy. What on earth are we going to be building in a bearish economy, in a recession, in a near depression? Sorry, I don't think iron ore is the move here. And I don't want to invest in a coal company who has heavy allocations to things like iron ore and zinc. So that's the first thing. Second thing, if you didn't already know, not all coal is alike. You can kind of separate into more energy producing coal and then metallurgical coal. The metallurgical coal does what you think it does. It has a higher carbon content, it's harder, less efficient overall, but really good for making metals and metallic alloys. Lignite coal, brown coal, crappy, dirty, yucky, lignite coal is the main thing I'm targeting here. And I am hoping to get in sooner rather than later. Because I know stranger things have happened, but I just don't see a ton of downside here. The two largest countries in the world in terms of population and the fifth highest in terms of population have all figured out the right answer already. At least it's the right answer for now. And likely the rest of this decade. And unless you can tell me what exactly is going to take coal's place for the rest of this decade in terms of cheapest and most efficient fuel source, that I think picking a winner here is gonna be quite easy. And no, this does not mean I'm still not very bullish on things like natural gas and uranium, I am. But given what I've told you today, how can you not be bullish on coal too? How can you not be adding that to the mix? Because whether this whole energy crisis happens or it doesn't, I still don't think putting my money down in coal right now is crazy at all. I still think I'm going to be early here."}, "podcast_summary": "This is the 10-Minute Contrarian Podcast hosted by VP. In this episode, VP discusses the concept of the energy cliff and the potential consequences of a lack of energy supply. He emphasizes the importance of energy for modern society and the potential chaos that could occur if there is a shortage. VP also mentions the decline of the ESG (environmental, social, and governance) movement and the resurgence of coal as an energy source. He sees coal as a contrarian investment opportunity, especially in countries like China and India where coal consumption is high. Overall, VP believes that coal will continue to be in demand, especially during times of energy crisis.", "podcast_guest": "VP", "podcast_highlights": "Energy is everything. Without it, life just doesn't exist for most people. The Western world has always had things right there exactly when we wanted them. Now imagine that same inconsistency, but with actual energy. And in times of necessity, like a big recession or an energy crisis, coal is only going to get more popular and more in demand."}